{
    "idleheroes": [
        "Another foolish Chinese blinded by Xi's dick rammed so fucking deep into their mouth that their, tiny, malnourished brain can't think properly.\n\n1. All? Where does it say that every single Chinese person is in an evil cult? If it only shits on people believing in the communist party, then they are right though.\n\n2. Good symbolism.\n\n3. Malicious and low act? That describes Xi's dictatorship pretty well. Why is it bad? Seems like a good comparison to me.\n\nPls go back to r/IdleHeroes ."
    ],
    "Aspen": [
        "There were a lot of things we couldn't do in an Cessna 172, but we were some of the slowest guys on the block and loved reminding our fellow aviators of this fact. People often asked us if, because of this fact, it was fun to fly the 172. Fun would not be the first word I would use to describe flying this plane. Mundane, maybe. Even boring at times. But there was one day in our Cessna experience when we would have to say that it was pure fun to be some of the slowest guys out there, at least for a moment.\n\nIt occurred when my CFI and I were flying a training flight. We needed 40 hours in the plane to complete my training and attain PPL status. Somewhere over Colorado we had passed the 40 hour mark. We had made the turn back towards our home airport in a radius of a mile or two and the plane was performing flawlessly. My gauges were wired in the left seat and we were starting to feel pretty good about ourselves, not only because I would soon be flying as a true pilot, but because we had gained a great deal of confidence in the plane in the past ten months. Bumbling across the mountains 3,500 feet below us, I could only see the about 8 miles across the ground. I was, finally, after many humbling months of training and study, ahead of the plane.\n\nI was beginning to feel a bit sorry for my CFI in the right seat. There he was, with nothing to do except watch me and monitor two different radios. This wasn't really good practice for him at all. He'd been doing it for years. It had been difficult for me to relinquish control of the radios, as during my this part of my flying career, I could handle it on my own. But it was part of the division of duties on this flight and I had adjusted to it. I still insisted on talking on the radio while we were on the ground, however. My CFI was so good at many things, but he couldn't match my expertise at sounding awkward on the radios, a skill that had been roughly sharpened with years of listening to LiveATC.com where the slightest radio miscue was a daily occurrence. He understood that and allowed me that luxury.\n\nJust to get a sense of what my CFI had to contend with, I pulled the radio toggle switches and monitored the frequencies along with him. The predominant radio chatter was from Denver Center, not far below us, controlling daily traffic in our sector. While they had us on their scope (for a good while, I might add), we were in uncontrolled airspace and normally would not talk to them unless we needed to ascend into their airspace.\n\nWe listened as the shaky voice of a lone SR-71 pilot asked Center for a readout of his ground speed. Center replied:\"Aspen 20, I show you at one thousand eight hundred and forty-two knots, across the ground.\"\n\nNow the thing to understand about Center controllers, was that whether they were talking to a rookie pilot in a Cessna, or to Air Force One, they always spoke in the exact same, calm, deep, professional, tone that made one feel important. I referred to it as the \" Houston Center voice.\" I have always felt that after years of seeing documentaries on this country's space program and listening to the calm and distinct voice of the Houston controllers, that all other controllers since then wanted to sound like that, and that they basically did. And it didn't matter what sector of the country we would be flying in, it always seemed like the same guy was talking. Over the years that tone of voice had become somewhat of a comforting sound to pilots everywhere. Conversely, over the years, pilots always wanted to ensure that, when transmitting, they sounded like Chuck Yeager, or at least like John Wayne. Better to die than sound bad on the radios.\n\nJust moments after the SR-71's inquiry, an F-18 piped up on frequency, in a rather superior tone, asking for his ground speed. \"Dusty 52, Center, we have you at 620 on the ground.\" Boy, I thought, the F-18 really must think he is dazzling his SR-71 brethren. Then out of the blue, a Twin Beech pilot out of an airport outside of Denver came up on frequency. You knew right away it was a Twin Beech driver because he sounded very cool on the radios. \"Center, Beechcraft 173-Delta-Charlie ground speed check\". Before Center could reply, I'm thinking to myself, hey, that Beech probably has a ground speed indicator in that multi-thousand-dollar cockpit, so why is he asking Center for a readout? Then I got it, ol' Delta-Charlie here is making sure that every military jock from Mount Whitney to the Mojave knows what true speed is. He's the slowest dude in the valley today, and he just wants everyone to know how much fun he is having in his new bug-smasher. And the reply, always with that same, calm, voice, with more distinct alliteration than emotion: \"173-Delta-Charlie, Center, we have you at 90 knots on the ground.\"\n\nAnd I thought to myself, is this a ripe situation, or what? As my hand instinctively reached for the mic button, I had to remind myself that my CFI was in control of the radios. Still, I thought, it must be done - in mere minutes we'll be out of the sector and the opportunity will be lost. That Beechcraft must die, and die now. I thought about all of my training and how important it was that we developed well as a crew and knew that to jump in on the radios now would destroy the integrity of all that we had worked toward becoming. I was torn.\n\nSomewhere, half a mile above Colorado, there was a pilot screaming inside his head. Then, I heard it. The click of the mic button from the right seat. That was the very moment that I knew my CFI and I had become a lifelong friends. Very professionally, and with no emotion, my CFI spoke: \"Denver Center, Cessna 56-November-Sierra, can you give us a ground speed check?\" There was no hesitation, and the replay came as if was an everyday request. \"Cessna 56-November-Sierra, I show you at 76 knots, across the ground.\"\n\nI think it was the six knots that I liked the best, so accurate and proud was Center to deliver that information without hesitation, and you just knew he was smiling. But the precise point at which I knew that my CFI and I were going to be really good friends for a long time was when he keyed the mic once again to say, in his most CFI-like voice: \"Ah, Center, much thanks, we're showing closer to 72 on the money.\"\n\nFor a moment my CFI was a god. And we finally heard a little crack in the armor of the Houston Center voice, when Denver came back with, \"Roger that November-Sierra, your E6B is probably more accurate than our state-of-the-art radar. You boys have a good one.\"\n\nIt all had lasted for just moments, but in that short, memorable stroll across the west, the Navy had been owned, all mortal airplanes on freq were forced to bow before the King of Slow, and more importantly, my CFI and I had crossed the threshold of being BFFs. A fine day's work. We never heard another transmission on that frequency all the way to our home airport.\n\nFor just one day, it truly was fun being the slowest guys out there.",
        "How’s next-gen treating everyone? I’ve been enjoying my Series X quite a bit. Quick Resume is great, and I really appreciate the way my library carried over seamlessly. Some may not be excited by “it being just another Xbox” but it’s been absolutely wonderful for me. I look forward to if/when I can find a PS5 at GameStop (I have $500+ in trade credit saved up) and try out that experience.\n\nPlayed through the story mode of **Tetris Effect Connected** and adored every moment of it. “It’s just Tetris” feels like a cheap slant against what is a transcendentally beautiful experience. The multiplayer stuff is cool, when it works, but it has some niggles and issues that are a bit unfortunate, like not being able to leave a match once you’ve lost. The 3v1 mode is neat - has anyone figured out how to revive teammates? Maybe I’m the only one having these issues?\n\nI’m now very deep into **Wasteland 3** - I’m in Aspen, hunting down Vic. I’m level 20ish. The game constantly amazes me with its pacing, story-telling, and little moments of care. It runs much better on my Series X, too, and the load times are quicker! Hoping I’ll be finished with this by next week.\n\nPicked up a copy of **Yakuza Like a Dragon** but have held off on starting it until I’m done with Wasteland 3. Similar situation with **Gears Tactics**, though I did play the tutorial mission of that...and I know I’m in for a good time.\n\nChecked out the Series X update of **Forza Horizon 4** and despite the DF analysis (which I agree with - Panic Button, please fix it!) it’s still a stellar game, easily one of my favorites of the generation. It looks and plays incredible (but hopefully will improve even more...) at 4K/60 and the DLC is a blast.\n\n**Radiant Historia** guy...this was my weekly guilt trip. Sorry. Still haven’t touched it.\n\nNext-gen is here and I am a happy guy.",
        "There is ground traffic though? Can see it [in the Aspen video.](https://youtu.be/GqM9oJbtAPk?t=4)",
        "This is spectacular. The physical model and simulation of light in the atmosphere are second to none. It brings such a degree of reality to everything, I'm amazed all over again, especially the one of Baltimore and Aspen.",
        "While what we ended up with is arguably the worst timeline, TPP had a lot of shit in it that was downright scary.\n\nThe IP chapter alone needed to be staked through the heart with a stake made of aspen and buried at a crossroads on a moonless night.\n\nThe agreement also included a corporate sovereignty provision. Which would have been really bad as well.",
        "\"You can tell that it's an Aspen tree because of the way it is.\"",
        "CS:GO was at X-Games Aspen hosted by MLG. By far one of the best non-major events, I watched nearly every game. ",
        "Aspen?",
        "There were a lot of things we couldn't do in an SR-71, but we were the fastest guys on the block and loved reminding our fellow aviators of this fact. People often asked us if, because of this fact, it was fun to fly the jet. Fun would not be the first word I would use to describe flying this plane. Intense, maybe. Even cerebral. But there was one day in our Sled experience when we would have to say that it was pure fun to be the fastest guys out there, at least for a moment.\n\nIt occurred when Walt and I were flying our final training sortie. We needed 100 hours in the jet to complete our training and attain Mission Ready status. Somewhere over Colorado we had passed the century mark. We had made the turn in Arizona and the jet was performing flawlessly. My gauges were wired in the front seat and we were starting to feel pretty good about ourselves, not only because we would soon be flying real missions but because we had gained a great deal of confidence in the plane in the past ten months. Ripping across the barren deserts 80,000 feet below us, I could already see the coast of California from the Arizona border. I was, finally, after many humbling months of simulators and study, ahead of the jet.\n\nI was beginning to feel a bit sorry for Walter in the back seat. There he was, with no really good view of the incredible sights before us, tasked with monitoring four different radios. This was good practice for him for when we began flying real missions, when a priority transmission from headquarters could be vital. It had been difficult, too, for me to relinquish control of the radios, as during my entire flying career I had controlled my own transmissions. But it was part of the division of duties in this plane and I had adjusted to it. I still insisted on talking on the radio while we were on the ground, however. Walt was so good at many things, but he couldn't match my expertise at sounding smooth on the radios, a skill that had been honed sharply with years in fighter squadrons where the slightest radio miscue was grounds for beheading. He understood that and allowed me that luxury.\n\nJust to get a sense of what Walt had to contend with, I pulled the radio toggle switches and monitored the frequencies along with him. The predominant radio chatter was from Los Angeles Center, far below us, controlling daily traffic in their sector. While they had us on their scope (albeit briefly), we were in uncontrolled airspace and normally would not talk to them unless we needed to descend into their airspace.\n\nWe listened as the shaky voice of a lone Cessna pilot asked Center for a readout of his ground speed. Center replied: \"November Charlie 175, I'm showing you at ninety knots on the ground.\"\n\nNow the thing to understand about Center controllers, was that whether they were talking to a rookie pilot in a Cessna, or to Air Force One, they always spoke in the exact same, calm, deep, professional, tone that made one feel important. I referred to it as the \" Houston Center voice.\" I have always felt that after years of seeing documentaries on this country's space program and listening to the calm and distinct voice of the Houston controllers, that all other controllers since then wanted to sound like that, and that they basically did. And it didn't matter what sector of the country we would be flying in, it always seemed like the same guy was talking. Over the years that tone of voice had become somewhat of a comforting sound to pilots everywhere. Conversely, over the years, pilots always wanted to ensure that, when transmitting, they sounded like Chuck Yeager, or at least like John Wayne. Better to die than sound bad on the radios.\n\nJust moments after the Cessna's inquiry, a Twin Beech piped up on frequency, in a rather superior tone, asking for his ground speed. \"I have you at one hundred and twenty-five knots of ground speed.\" Boy, I thought, the Beechcraft really must think he is dazzling his Cessna brethren. Then out of the blue, a navy F-18 pilot out of NAS Lemoore came up on frequency. You knew right away it was a Navy jock because he sounded very cool on the radios. \"Center, Dusty 52 ground speed check\". Before Center could reply, I'm thinking to myself, hey, Dusty 52 has a ground speed indicator in that million-dollar cockpit, so why is he asking Center for a readout? Then I got it, ol' Dusty here is making sure that every bug smasher from Mount Whitney to the Mojave knows what true speed is. He's the fastest dude in the valley today, and he just wants everyone to know how much fun he is having in his new Hornet. And the reply, always with that same, calm, voice, with more distinct alliteration than emotion: \"Dusty 52, Center, we have you at 620 on the ground.\"\n\nAnd I thought to myself, is this a ripe situation, or what? As my hand instinctively reached for the mic button, I had to remind myself that Walt was in control of the radios. Still, I thought, it must be done - in mere seconds we'll be out of the sector and the opportunity will be lost. That Hornet must die, and die now. I thought about all of our Sim training and how important it was that we developed well as a crew and knew that to jump in on the radios now would destroy the integrity of all that we had worked toward becoming. I was torn.\n\nSomewhere, 13 miles above Arizona, there was a pilot screaming inside his space helmet. Then, I heard it. The click of the mic button from the back seat. That was the very moment that I knew Walter and I had become a crew. Very professionally, and with no emotion, Walter spoke: \"Los Angeles Center, Aspen 20, can you give us a ground speed check?\" There was no hesitation, and the replay came as if was an everyday request. \"Aspen 20, I show you at one thousand eight hundred and forty-two knots, across the ground.\"\n\nI think it was the forty-two knots that I liked the best, so accurate and proud was Center to deliver that information without hesitation, and you just knew he was smiling. But the precise point at which I knew that Walt and I were going to be really good friends for a long time was when he keyed the mic once again to say, in his most fighter-pilot-like voice: \"Ah, Center, much thanks, we're showing closer to nineteen hundred on the money.\"\n\nFor a moment Walter was a god. And we finally heard a little crack in the armor of the Houston Center voice, when L.A.came back with, \"Roger that Aspen, Your equipment is probably more accurate than ours. You boys have a good one.\"\n\nIt all had lasted for just moments, but in that short, memorable sprint across the southwest, the Navy had been flamed, all mortal airplanes on freq were forced to bow before the King of Speed, and more importantly, Walter and I had crossed the threshold of being a crew. A fine day's work. We never heard another transmission on that frequency all the way to the coast.\n\nFor just one day, it truly was fun being the fastest guys out there.\n\n",
        "&gt; they blew up a planet.\n\nOn top of that the entire planet was basically Space Colorado! Empire did everyone a favor, saved them from Space Boulder and Space Aspen! God, do you want to live in a universe where Space Aspen is a thing!? ",
        "Considering MLG held a CS:Go event at X-Games Aspen I think that level would be reasonable.\n\nHow to separate Leagues is a much bigger question. League of Legends is separated by Riot Games into leagues by region with 2 big international events a year which is successful but leaves people wanting international competitions. On the other hand CS:GO LANs are pretty much always international with regional online events. Both sides have advantages and disadvantages so I believe the issue won't be settled for a long time.",
        "&gt;I see this viewpoint pop-up all the time. It is popular to say that popular mainstream titles are \"just not that good\" when they are critically acclaimed. It happened to bioshock infinite as well as FO4.\n\nThis has nothing to do with the game being critically acclaimed or well received by the media or the community, but the specific faults with Bethesda games that people are willing to overlook because its a Bethesda game.  For the record I enjoyed FO4 much more than I did Skyrim, and Bioshock Infinite was a really excellet game.\n\n&gt;You can freely create your gameplay experience (rogue, Mage, warrior or any hybrid of skills and stats)\n\nThe problem is that in Skyrim the gamplay experience *is bad*.  The difference between Warrior and Mage is that as a mage you want your blue meter to drain slower than the enemies red meter, and that as a warrior you want your yellow meter to drain slower than your enemies red meter.  \n\n\n&gt;It has a vividly imagined world, a world that goes from aspen groves to old-wood forest to frozen tundra and Arctic iceflows, is seamless, expands over many kilometers, and is packed full of regionally unique monsters/ clans/ animals.\n\nThis is some next level rose-colored reimagining of how full the Skyrim world.  The fact of the mater was that the world is pretty empty, and all those wonderful cover two biomes.  Boreal forrest and arctic.  Hardly expansive.  This in and of itself isn't bad.  Developers would do themselves a favor focus on fewer deeper areas than spreading them selves out as thin as they did with Skyrim.  Yes, its really expansive, but its just not very deep, which is why I referred to it as \"samey\".\n\n&gt;The combat may not be uniquely amazing, but it is far from terrible.\n\nYes it is.  Combat is completely uninspired and tedious.  \n\n&gt; So name me another game that lets you create the character you wish to be, in a world as large and as well realized as Skyrim, that is as visually advanced and appealing. If you can't (and I'm fairly certain you cannot), then you are simply being edgy by hating on it.\n\nThe Gothic Series (although they have slipped some recently).  Dark Souls.  I would argue World of Warcraft.  The Wizardry Series (Its party based but a blobber so I'm counting it).  FUCKING MORROWIND.  And this is just using games that are single player non-party RPGs.  If we were to include party based RPGs the list gets much bigger.",
        "I see this viewpoint pop-up all the time. It is popular to say that popular mainstream titles are \"just not that good\" when they are critically acclaimed. It happened to bioshock infinite as well as FO4.\n\nYou know what people think Skyrim does well, it has been stated time and time again. You can freely create your gameplay experience (rogue, Mage, warrior or any hybrid of skills and stats) It has a vividly imagined world, a world that goes from aspen groves to old-wood forest to frozen tundra and Arctic iceflows, is seamless, expands over many kilometers, and is packed full of regionally unique monsters/ clans/ animals. It is also beautifully sculpted and has convincing topography. The music and sound effects are excellent. The towns are culturally distinct, have vastly differing architecture, and are filled with things to do. The combat may not be uniquely amazing, but it is far from terrible. \n\nLet me ask you this, what game is better than Skryim at what Skyrim attempts to do? Can you name a single game that is comparable? \n\nI hated having to be Geralt in TW3 (I hated being Geralt in TW2, I don't know why I expected TW3 to be anything different). The world may be better looking, the story may be better, but what does it matter if I am tied down to being some sort of long-haired weirdo forced to use a two-sword type system in a gameplay paradigm that I am not at all interested in. \n\nSo name me another game that lets you create the character you wish to be, in a world as large and as well realized as Skyrim, that is as visually advanced and appealing. If you can't (and I'm fairly certain you cannot), then you are simply being edgy by hating on it. \n",
        "Oh btw \n\n&gt;Microsoft has entered into a sponsorship partnership with ESPN to debut Halo 5: Guardians eSports at X Games Aspen 2016, which takes place Jan. 28-31. \n\nhttp://fortune.com/2016/01/26/espn-halo-x-games-esport/",
        "Eh, people never thought we'd land on the moon, but I was at a bar in Aspen, the Avalanche, and saw that we did.",
        "Perhaps because the founders of kickstarter looked at art patronage as the inspiration for their site:\n\n&gt; At a talk at the Aspen Ideas Festival this afternoon, Kickstarter co-founder Perry Chen talked with Walter Isaacson about the historical roots of the Kickstarter model. It wasn't just the Medici or the Church that funded the arts, Chen said. Artists themselves have also looked to the crowd, directly, to get funding for their projects. \n\n&gt; Alexander Pope, when he translated The Iliad from Greek to English, had a group of about 750 people who subscribed to the work, essentially micro-funding its publication, Chen said. And as a reward for effectively \"backing\" the project, \"they got their names inscribed in the first edition.\" Mozart looked to a similar model to fund the composition of one of his concertos, Chen said. (\"Actually, the first time he tried to fund it, he didn't raise the money\" -- he had to try again the next year before successfully funding his work.) And the pedestal of the Statue of Liberty was funded by more than 100,000 people.\n\n&gt;So Kickstarter's crowdfunding model, in other words, is neither as new nor as unique as it might seem. It represents an innovation in degree rather than kind. As Walter Isaacson summed it up: \"This ain't a new idea; there's a long history of it.\"\n\nKickstarter *is* art patronage, calling it art patronage is not inaccurately describing it, and it's not tacking on a name to call it such either.\n\n[Source](http://www.theatlantic.com/technology/archive/2013/06/kickstarters-of-yore-mozart-lady-liberty-alexander-pope/277389/)",
        "http://www.pixeldynamo.com/news/gaming/2014/08/21/25414/esl-one-cologne-csgo-2014-breaks-400k-viewers/\n\nPeaked at more than 400k viewers on a Major whereas there was around 200k viewers at a previous Major the same year.\n\n\nPeople watching almost doubled, because even though the game isn't free, it is still cheap.\nIt offers as well quite the spectacle with really tight game and impressive plays, making the viewers experience, even for those not playing the game, really entertaining matches.\n\n\nAnd the game keeps growing, bringing in more viewers.\n\nExample from the last event of this week-end : MLG X-Games Aspen 2015, NiP vs Fnatic, really tight game:\n\n\nMap1 : https://www.youtube.com/watch?v=IrD8PU5t4qA\n\nMap2 : https://www.youtube.com/watch?v=O0JzAtYQppE\n\nMap3 : https://www.youtube.com/watch?v=HCe9rU6JEgE",
        "There were other off hand remarks. He also adopted Cameron's iconography for Weyland Yutani and the spelling of it as depicted in Aliens.\n\n\"The company's original name was Weylan-Yutani, briefly seen on a monitor and Aspen Beer can in the film Alien; this name was created by Ron Cobb, one of the designers of the Nostromo and its crew's uniforms. In the film, the company's logo consisted of a winged sun emblem, based on Egyptian architecture. The original Weylan-Yutani name notably reappeared in David Twohy's script for Alien3, in which the company was repeatedly referred to using its pre-Aliens name.\n\n\"One of the things I enjoyed most about Alien was its subtle satirical content. Science fiction films offer golden opportunities to throw in little scraps of information that suggest enormous changes in the world. There's a certain potency in those kinds of remarks. Weylan Yutani for instance is almost a joke, but not quite. I wanted to imply that poor old England is back on its feet and has united with the Japanese, who have taken over the building of spaceships the same way they have now with cars and supertankers. In coming up with a strange company name I thought of British Leyland and Toyota, but we couldn't use \"Leyland-Toyota\" in the film. Changing one letter gave me \"Weylan\", and \"Yutani\" was a Japanese neighbor of mine.\"\n―Ron Cobb on conceptualizing Weylan-Yutani \n\nWhen James Cameron was assigned to write and direct an Alien sequel, the role and significance of the company increased greatly. Cameron added a \"d\" to the first part of the company's name, and also scrapped the original winged sun emblem, replacing it instead with a new corporo-industrial interlocked W/Y logo of his own design. This logo can be viewed in various places throughout the movie, most obviously in the extended Special Edition, where it is seen on crates and the front of a child's tricycle at the Hadley's Hope colony before the Xenomorph outbreak.[16] Cameron has gone on record as saying that the way in which Burke accompanies the Colonial Marines on their mission to LV-426 was supposed to invoke the conspiracy of America's involvement in Vietnam being for purely corporate interests. The prominent use of the company in the film propelled it to being an indispensable element the Alien universe.\"\n\n\nSo basically, Ridley has commented repeatedly how much he respects/adores Aliens and he adopted James Cameron's spelling and (core) logo for Weyland in Prometheus. I thought I recall him saying something more on the nose, but I can't find it. \n\nI don't know about you, but although I have issues with how the Alien was depicted in Aliens it was still an excellent movie and I believe it to be canon. \n\n\nAs for the Alien's depiction in this game- we have to accept the limitations of 1979. They didn't want the creature to look like a guy in a suit. I appreciate what they're doing in that regard. They're back to the 'dome head' because this whole game is an homage to the first movie stylistically. I accept that there are some compromises going on to accommodate this and that they've added their own touches on the Xenomorph, probably to make it more frightening and powerful. I'm alright with what they've done so far.",
        "Movie context: There is a guy named Lloyd Christmas and his friend Harry, who are pretty dumb, who travels across the country in a van that looks like a dog from Rhode Island to Aspen, Colorado to return a brief case to a pretty girl. Note that Lloyd has little social tact.\n\nScene Context: On a pit stop for their trip to Aspen, Lloyd walks up to a bunch of random people that he's NEVER MET in his life, and is like \"Hey guys! Big Gulps huh? WELP SEE YA LATER!\"\n\nThe scene is funny because imagine someone actually doing that.\n\nThe context that knucles uses it in, just comes off as a cry of severe depression :/",
        "I wouldn't say Call of Duty and crude humor, COD is only like 7% of the show at max unless there's something big.\n\nBut the humor is pretty damn crude, last week they had Harley (the beard guy) from Epic Meal Time, they also have had Wax(Rapper), and Aria Aspen(Pornstar). Most of the time their guests are Call of Duty commentators though.\n\nI would call it poorly formatted, but most of the time it works to its benefit. I love this show and haven't missed an episode.\n\nIt's usually 2-3 hours in length, i've been a fan since episode 3.",
        "Easily Jurassic park: operation genesis. Like the sims or thrillville, but with FUCKING DINOSAURS!!!!\n\nGetting bored, why not unleash a velociraptor into a dilophosaur enclosure? Or better yet into the park at large and let him rape your guests.\n\nOr a spinosaur against a T-Rex because: why not?\n\nIs there a hurricane on the horizon? Fuck your guests; they can't give negative reviews if they're dead. \n\nWhy not just take the helicopter out for aspen to sedate some random dinos?\n\nSuch an emasculating game"
    ],
    "Fiona": [
        "The game really needs you to do specific things in order to progress the story and often these things are predicated on you completing some clue prior to that. After the tutorial is over you essentially have like three or four quest trails that you are just ticking off to progress the story. You can hop between them, but with the how the game is set up you there isn't much point in doing so. The game very very quickly narrows down you options for progression once you figure out you need to get Charlie and Fiona together. At a certain point I was just getting a clue or two and reseting the run because there wasn't much of a point in exploring once you have your desired weapon.",
        "You’re 100% right. Also Transistor is totally different from the rest of their games’ music but it still stands to be an incredible soundtrack. There’s some poppier songs on there with vocals that could be radio-ready — those Ashley Barrett cuts sound like if Fiona Apple released an electronic album.",
        "Not sure why they call Fiona Nova a Twitch streamer. I don't think she's streamed in like two years. Would be better if they recognized her for her work at Rooster Teeth.",
        "Or how they give you tormod and maurim for one chapter and you think wow I have some decent units now and then they fuck off until endgame.\n\nOr how they give you volug who seems like a decent unit until you realise you can't level him up at all outside of the untransformed beastfoe swamp strat.\n\nOr how every other unit in the game has an instakill mastery except sothe, the assassin who perfers to leave people alive.\n\nOr how when you first get a mounted unit in fiona the next chapter is an indoor map with decreased movement and a swamp. But she sucks ass anyway maybe the game is doing you a favour there.",
        "Good old cheapskate Randy. Just think of how many magic sets he was able to buy with all the money he saved on not having to pay Troy Baker. Or Laura Bailey since he just cut out Fiona completely. Or the Original Claptrap. That last one he not only didn’t pay, he also allegedly punched him in the face. Oh Randy, you absolute asshole.",
        "Having Rhys but not Fiona in the game is such a spit on TftBL's face ! They were both the main character, they worked as a foil to eachother !",
        "Having Rhys present in BL3 but not Fiona is the biggest spit you could do on Tales. The entire point of it was that they worked as a foil to eachother.",
        "I still can't believe they totally ignored Fiona. Wild.",
        "&gt; brings in a couple of Tales folks up front \n\nThey might as well not have. No interaction between Rhys and Vaughn at all, Fiona and Sasha seem to be completely missing, I don't think they're even mentioned.",
        "\"Eh guys, let's end the Pre-Sequel on a cliffhanger showing Athena's importance on the plot\"\n\n\"Okay, should we have her appear in the next game ?\"\n\n\"Lol no. And no Fiona either, because people that cared about Rhys surely don't care about Fiona, right\"",
        "Forever upset BL3 didn’t really canonize any choices except for Rhys x Sasha because BL3 writers probably don’t even know there is a Rhys and Fiona ending.",
        "Yeha, sister was sweet and all, but the Ryhs-Fiona chemistry was a real banger.",
        "If it makes you feel any better, just imagine he's an imposter &gt;!who stepped in to take over Atlas after Rhys and Fiona vanish at the end of Tales.!&lt;",
        "I was honestly shocked by how they did the cast of that game (and Borderlands 2, for that matter) so dirty in Borderlands 3. Only two characters appear, one of them being probably the most annoying Borderlands character since Claptrap and he has WAY too much prominence in the story, and one of the main characters who isn't even voiced by his original voice actor.\n\nNo Fiona, no Loaderbot, not even Gortys. It's like they picked characters out of a hat. Not to mention the pretty insulting lack of Pre-Sequel/Borderlands 2 playable character representation.",
        "Fiona: Of Potatoes and Famine",
        "Thanks for summing it up. It's 100% the top game of the year for me, and a new landmark for our medium. \n\nIt's the same thing with music for me. Listening to Fiona Apple earlier this year, you just instantly go \"That's it. No one can top this this year.\"",
        "Man, even though I know they updated Payback to make the upgrade mechanic much better, I still don't know if I'd get it even when it's free. I value my time as much as my money, maybe even more so, and I just don't see NFS Payback as potentially being the most fun, even compared to double-dipping with a rumored Hot Pursuit 2020 remaster.\n\nI honestly think NFS 2021 will be notably better than any of the four titles Ghost put out, since they're moving things back to Criterion. Keep in mind that the last NFS to get above 80 on MetaCritic was developed by Criterion, being Most Wanted 2012. Plus, I heard the major reason that NFS development is moving back to the UK is because it's a lot easier to find talent there than it was in Sweden, where Ghost was based. That said, some key members of Criterion have also left to form Three Fields Entertainment since Most Wanted 2012 - specifically Alex Ward and Fiona Sperry - so we'll see if Criterion still has its touch come next fall, when I can only assume the next NFS will get released. \n\nI also think it's highly likely that NFS Heat had more notable content updates and DLC planned, but was cut short by Covid-19, as well as the decision to move NFS development back to the UK.\n\nFinally, I'm also hoping the Hot Pursuit 2010 remaster will include all the DLC - including some cars that were exclusive to the Xbox 360 version, and were part of a collaboration with Dr. Pepper. They were the racer versions of some police cars, such as the Porsche Cayman, though even without that promotion, racers would get convertible variants of those same cars, like with the Nissan 370Z. The only exception, I believe, was the Porsche Panamera, which had a racer version exclusive to the promotion.",
        "I'm almost glad they didn't bring back Athena, Fiona, Gordys, Loaderbot, etc. Because I have no doubt they would've ruined them in the base game.",
        "I'm glad they didn't bring back Fiona, Gordys, and Loaderbot now, because I'm convinced they would've ruined them, too.",
        "Vaughn abs was 2 second joke in tales and he also barely said bro. The only time he said it a ton was when Fiona was pretending to be him and Rhys. But they couldn’t think of anything to do with him so those 2 jokes are now his entire character",
        "As a fan of tales from the borderlands I hate what they did to Vaughn. They took 2 quick jokes from the game ( the fact that he’s ripped and when Fiona imagines him and Rhys saying bro constantly) and made it his entire character",
        "Heat isn't *that* great. It's likely going to be the best game from the Ghost era, which I can't say is saying much. Hopefully NFS 2021 will be notably better, now that Ghost is getting re-absorbed into Criterion. Keep in mind that the last NFS game to get above 80 on MetaCritic *was* developed by Criterion, being Most Wanted 2012. Now, it may be another factor that the main brains of Criterion are now at Three Fields Entertainment, namely Alex Ward and Fiona Sperry, but I'm still optimistic that EA will have better luck finding talent in Guilford rather than Gothenberg.",
        "It's typical with Western comics. If it's an ongoing series, typically different writers and artists will move to and from the book. So like Batman was previously written by Tom King, with art by David Finch, but Finch was only on a few of the books, before someone else came in. \n\n\nWhile something like Saga is and is still written by Brian K Vaughan and art by Fiona Staples. Because unlike Batman, it's a narrative story with a proper beginning, middle, and end. \n\n\nManga is more of 1 artist who usually is also the writer, because that's how the style is. Obviously there are some exceptions.",
        "The team is based in Southern Spain, so I have to guess it's inspired in the [nazarenos](http://www.thespainscoop.com/wp-content/uploads/2013/03/FIONA-Nazarenos-from-Los-Estudiantes.jpg). And no, before anyone freaks out about the KKK, this is an ancient religious custom in Spain that has absolutely nothing to do with white supremacy.",
        "Her Catwoman sounds the same as her Fiona in Tales From the Borderlands. I don't understand thinking she did a good job there. Especially when her depictions and writing are actually pretty good, it's just the VA that fails to sell it as anything but Laura Bailey.",
        "I've blind tested mixes between 44.1k@16bit and 96k@24 bit and yes, I can tell in most cases. Whether on my Yamaha HS8's or even my powered Klipsch bookshelf speakers, I can hear a difference between those sample rates and bit depths.\n\nBut! To be fair, the biggest hit in quality isn't dropping things down to 44.1k. Most of my favorite albums are only available in 44.1k since there was no reason to bounce them at higher sample rates when CD's were the medium. The biggest reduction in quality comes from compression. Spotify songs don't sound a little blurrier because they got dropped down to 44.1k, it's because they have been smashed into an mp3 codec@256kbps. Whether this makes a difference depends on how complex the mix is and where the sweetspot is for the various instruments inside of it. Easier to spot artifiacts and \"soupiness\" in, say, Sufjan Stevens' Age of Adz album, than in Motion City Soundtrack's Commit This to Memory album. But then I can A/B test something like Iron &amp; Wine's Our Endless Numbered Days and still hear the difference because compression usually takes a lot off the high end where acoustic instruments really shine.\n\nAnd yes, I really am an audio engineer. It's how I've made my living for about 5 years now. There is a lot left to learn and I'll never know everything there is to know about it, but insisting that compression is costless is an odd thing. I understand not caring about it, but insisting the difference isn't there is too much to me. How much you hear the difference depends on a whole bunch of factors, including the way your ears and head are shaped, personal experience, etc, and also the mix itself. Sometimes the difference is downright dramatic. Fiona Apple's song \"For Her\" ends with a choir outro that start to sound like synths in the Spotify version I listened to first. There are some mixes I've A/B'd where entire instruments are most to compression.\n\nI mean, when a song is bounced as 44.1k .wav, it'd usually a couple hundred mb. The .mp3 version will be around 3 mb. Obviously, there is a difference.",
        "I get that. But I know fiction is fiction. And I know fiction can exist inside fiction.  &gt;!But to me it verged on it was all a \"It was all a dream or then I woke up ending. Again maybe I took it too personally because it almost like it retconned what I thought was the most interesting element of the story \"The Biggest, Most Awful, Most Tragic Event in Human History\" and replaced it with something not as interesting. !&lt;\n\nThere was still so much story that could have come out of The Event and I understand that they could still return to that story but it won't be the same &gt;!knowing that it is just a fictional story in another narrative. For the record I also hated the Fiona and Cake episodes of Adventure Time !&lt;",
        "Fiona being Alistair's mother was confirmed in the DA novel 'The Calling', which was released as promo material months before DA Origins was released. It's not a retcon, just people not knowing their lore.",
        "DLC 3 seems to be Spaghetti Western inspired, and it's really the *only* place Sasha/Fiona could fit that makes sense.",
        "&gt; Damn how could you leave Fiona out of the game?? \n\nHey be thankful, they could've put her in the game only to kill her off like some other characters.",
        "I was kinda shocked when they decided to continue the trend of 4 completely brand new characters that have zero relevance to the plot in BL3.  \n\nI thought for sure they'd change things up this time.  Fiona seemed like an obvious choice.  She wanted to a vault hunter.",
        "I do hope if we get a sequel to TFTB it follows from the first Tales game and not B3. Damn how could you leave Fiona out of the game?? \n\nAgreed with the humor too. My God that game had me laughing so much which I never expected from a video game. Usually a nose exhale.",
        "Fiona might fit into that one too, since she has the special revolver weapon.",
        "The spaghetti western DLC they teased (three, I think) also screams Salvadore. \n\nIf that's the case, it means Axton (BL2), Athena (TPS), Fiona (TT) are the only Vault Hunters we still know nothing about.",
        "Current art pop diverged pretty hard from the B-52s/Bowie scene.  More back towards what Brian Wilson envisioned when he made Pet Sounds.  Almost all of these modern developments in the genre can be traced back to Björk imo.  St. Vincent, FKA Twigs, Angel Olsen, Weyes Blood, Fiona Apple, Lorde, later Bon Iver... basically just think about it as high concept pop, they are using the genre’s sounds but not necessarily trying to make radio hits or stick to a formula, they experiment with cutting edge production techniques and more unique genre mixtures.  Often albums are designed to be cohesive artistic statements with intense visual supplementary material between music videos, packaging, tour set/clothing design, etc.  Check out [this list](https://www.albumoftheyear.org/genre/141-art-pop/2010s/).",
        "They made Vaugn into a bandit chief and turned his \"bro\" scale to 11 which made for an annoying combination.\n\nThe rest of them are okay, I haven't seen Fiona myself, don't think she is in the game.\n\nIt's not as big of a disappointment as Vaughn is but they ruined my boi Zer0 a bit too.",
        "I finished **Tales of the Borderlands**. I don't regret my time with the game, and it was enjoyable throughout, but I'm glad it was over. The final chapter seemed to drag and I think it's good I was so close to the end of it. I think a big problem was that the characters seemed to be goofs first, and actual characters second. While it fit Rhys, Fiona never seemed competent at what she was supposed to be competent in. ||Claptrap|| was a fun surprise for progressing the way I went through the game, and fit into the game narratively better here than in the Borderlands games themselves. And god bless the writers for how Gortys was portrayed. Never tired of that character.\n\nI finished **Atelier Ryza**. Sad to see it go. I can gripe about tutorializing and how some systems both seem overly complicated and unnecessary but I'll give the game the benefit of the doubt and say it was lost in localization, even though the localization was amazing. The world is nice, and it gave me a really satisfying JRPG itch after a lackluster time with Pokemon SwSh. The crafting and story around the characters are really the stars here over the battling, so it makes sense your final battle takes place before the final questing sequence or the final plot wrap-up. It really shows the stars of the game and contextualizes it at the end. Crafting continued to be both fulfilling and challenging. I'd spend hours to try to plan out crafting the perfect item and how to do it. It felt exhausting at times but worthwhile and really brought something out of the game that brought me back 10 years ago to my first time experiencing SpaceChem.\n\nI'm not sure *when* I'm trying another Atelier game. The next one I want to play, Ayesha, gets a PC and Switch release this Tuesday, but I've so far avoided an impulse purchase on amazon for that since I have other longer games I want to get through. It's definitely a question of when than if. And if people have recommendations for games, I'd love to have spoiler free chats about why a certain atelier game should be my next one.\n\nI continued through **Dicey Dungeons**. I think I'm past the honey moon phase with this game as the challenge is ramping up. Robot 3 and Thief 2 are kicking my butt, and I barely missed out on completing Warrior 3 due to some bad luck. I went ahead and finished Robot 4. What appealed to me about this game was the good mix of perceived challenge and a variety of options and right now I feel like I'm crossing a threshold. Still plenty of me to play, and it's the game I'll toss time into when I need a bit of time to kill instead of a longer play session, so here's hoping it's just a slump and my love for Dicey Dungeons continues next week.\n\nI started **Final Fantasy XIII-2**. There were a few mods I had to install to correct framerate and crashing issues so now the game is running a bit better. I'm very confused by the plot, especially as it continues on from Final Fantasy XIII, but with time travel being used as a central mechanic of the game, I'm open to that allowing them a bit of space to retcon. It's puzzling why they chose to pair up a guy with a character who got married at the end of the last game, but I like Noel more than Serah so far, so I'll keep it. I'm very curious about the game going forward, and I finished up at New Bohden before I put the game down today. Currently, my Mog is a tomato.\n\nI will be starting **Resident Evil 1 Remaster HD** streaming with a friend this week, and I might sneak time and play **Bury Me, My Love** this week with my roommates. I also plan to do a bit of postgame Atelier Ryza since I'm not ready to give up that world and character yet. With all of these games and my limited time, something will get cut but that's okay.",
        "An echo reveal that Rhys is trying to find Fiona.",
        "At least we got a photo of her on Rhys’ desk where as Fiona is just basent as well as my savior loaderbot",
        "Worst Game(s): Honestly I'm going with the Telltale series. GoT/Borderlands/Walking Dead S1 &amp; 3. They always felt too long, which is why I actually enjoyed Michone. The story beats were there, and it didn't waste any time while I still got to know the characters. Borderlands; I felt the characters were too \"normal\" to be in that world, even Fiona, especially when all we've seen is people not caring about death. \n\nBest Game(s): Dead Rising. Very fun but unforgiving checkpoints. Feel like I need someone who's played it before beside me to walk me through it. 3 is the only one I've finished so far, because of the lack of timers mostly.",
        "I don't really mind any mechanics, but to me, the best side quests are the ones that are consequential, and expands characters and can change the story even in minor ways.\n\nThe one that immediately comes to mind is the Fiona's Forest quest in Chrono Trigger, where the quest starts in the middle ages, but in fact is affected by your decision in the Zeal era, which is quite a bit earlier. Fiona tells you that nothing she plants lives. In the present age, the area is a complete desert. You do a quest that involves killing the monster that's been sapping the energy from the area, and then go back to Fiona so she can plant the seed.\n\nHowever, it's impossible for her to revive a forest by herself. Your party member Robo volunteers to help, and stays. For 400 years, he plows the desert and plants seeds, while the party jumps to present day and it has become a forest. The party fixes him up, and you get [this iconic cutscene](https://imgur.com/gallery/h8V6d/comment/860705164). This shows how amazing Robo, that he's willing to spend centuries helping someone.\n\nAt the end of this quest, you also have a very important story moment invoking Lucca's past that's impossible to access without having revived the forest.\n\nAll in all, this side quest is an example of a side quest that did everything right.",
        "Yeah, it's hilarious. Tormod is *overleveled* when you first get him in Part 1 and then impossible to use in the endgame. And I'm not going to waste my time trying to train Eddie or Fiona when there are so many other units that can better use the training.",
        "At least Rhys had a picture of Sasha on his desk... I’m not done the game but I doubt Fiona is gonna show up and that hurts me",
        "From the little I've played of 3, Rhys is a semi important NPC on one planet, you run into Vaughn in the first part of the game.  Not sure if you see Fiona or her sister they keep trying to hook up with Rhys though.",
        "Maybe I missed it, but what did Rhys find in the vault after tales??? And what happened to Fiona and her sis?",
        "Fiona is actually mentioned in a tape, just not by name.",
        "There is a pic of sasha in rhys' office and an audio log where he mentions that (I'm assuming) sasha and fiona have gone off the grid.",
        "&gt; I feel like Tales was almost a requirement for BL3.\n\nI have to disagree on that. Vaughn is shoved aside as a minor character, and while Reis does play a decent size roll, his ties to Hyperion or his past as a vault hunter is completely non-existant. Also Vaughn and Reis never speak to each other despite being best friends. Not to mention the fact that Fiona, Sasha, Athena or any of the other characters aren't around or haven't even been mentioned.",
        "This is exactly why I stopped watching Shameless, too. Especially seeing Fiona and Lip build up and throw it all away every season, it was just a pointless cycle.",
        "Yes the characters he mentioned are not from a borderlands game.  They are from a third party movie of the game.  VERY FEW borderlands fans watched that interactive movie.  We just met Rhys in 3, I have no clue who Sasha or fiona is, nor do I care because tell tale \"games\" are terrible and should not be cannon in borderlands.",
        "I love Tales From the Borderlands but I can assure you Vaughn sucked there too. Fiona, Rhys, Loader Bot and Gortys stole the show for me.",
        "Yeah, but you still have the specifics that would change like &gt;!Who you take with you when you tackle the vault, weather or not Rhys and Sasha hooked up, or if Fiona followed up on being a Vault Hunter.!&lt;",
        "&gt;1. How does the story compare to BL2?\n\nIMO, it doesn't. You should know that I'm a little biased in this, because I am a staunch defender of BL2's writing; I consider it really, *really* genuinely well written (it has some of my favourite little writing tricks in gaming).\n\nBut IMO, the story just does not hold up this time, at all. The dialogue all feels flat and forced. Characters feel lifeless - in BL2, characters felt like they had their own genuine personalities and problems; Lilith quietly and awkwardly wanted Roland back, Tannis dealt with her own mental issues while adjusting to life among people, Roland struggled with the burden of saving an entire planet, etc. That doesn't feel like the case in BL3. Characters are very, very surface level. They exist for punchlines and plot developments, and that's about it. And the plot itself feels very rushed, and forced. The game ushers you from point A to point B with very little time spent ensuring that you actually care. The game tries to have big emotional moments, and they come off as so hollow compared to things like Where Angels Fear to Tread.\n\nBut possibly my least favourite thing is how poorly BL3 serves as a followup to its predecessors. It just really doesn't feel like it cares about the foundations laid out by The Pre-Sequel and Tales from the Borderlands. Remember the plot hook at the end of TPS, where an Eridian shows up and tells Lilith to prepare for war and collect all the vault hunters she can? That Eridian doesn't show up and is not mentioned; said \"war\" isn't mentioned; nothing is said of Lilith gathering vault hunters. Hell, only two of six BL2 characters are in the game, and one of them is basically a cameo. Fucking Krieg doesn't show up even though Borderlands 3 contains pretty much the most relevant possible scenario for him to show up. Athena isn't present, despite being such a huge part of TPS and Tales. The only characters present from Tales are Rhys and Vaughn, but Vaughn is basically a completely different character, Rhys has been flanderized to hell, and they never interact. The cliffhanger at the end of Tales is left entirely unresolved - we have no idea what happened to Rhys or where Fiona even is.\n\nYou get my point. It's just frustrating how little the game cares about executing on plot hooks that were previously set up. Maybe part of that is because Gearbox didn't make TPS or Tales, but they are still canon, and IMO they deserve more respect than being basically entirely ignored like they were in BL3. It's even worse for the missed opportunities that creates (seriously, Krieg should have been here).\n\nAnyway, that part is a long tangent that I'm pissy over. In general, though? The writing feels shallow. Say what you will about BL2's humour, but there was genuine passion put into that story. The efforts to which the game made you despise Handsome Jack, and mourn the deaths of your allies, and come to know and care about the world were immense and heartfelt. BL3 never feels like it comes close to that.\n\nIt has some pros, though. The worldbuilding finally steps up a bit; some new characters are pretty fun (I really like Lorelai, your main contact on Promethea); there's some enjoyable fanservice in the form of cameos and such. But it all feels so hollow when putting it next to BL2 and Tales.",
        "My main issue with Rhys in 3 is that's he's utterly useless. Where's the Rhys that crashed Helios just to kill Jack? And then ripped off his arm and pulled out his own eye?\n\nIt's such a shame because Rhys and Fiona are without a doubt the best characters in the series as well.",
        "I wonder if it partially has to do with the way the dialogue and story is conveyed. Borderlands proper has very few cutscenes and most dialogue happens over a radio play. \n\nTales had a much more directed process and could be more subtle with their jokes setting up environmental humor and visual gags to mix up the humor. The finger gun scene would NEVER work as well in the way Borderlands tells its story, and almost all of the gags in the opening credits (Rhys and Scooter eyeing Fiona in Ep 4 is one I particularly enjoyed) are wordless and only work because the player cant help but look at it. \n\nAlso Handsome Jack had something that the Calypsos (at least at the point I am in the story) don't seem capable of having: depth. Handsome Jack was hate-able, but because he's so full of himself and so sure that HE is the one that's the hero and in another story he'd be the Westley/Dread Pirate Roberts character with a funny wit and confidence. But he's in the wrong, and it makes the moments when you beat him that much more impactful because he has to double down on his beliefs and has a legitimate reason to be MAD at the player. \n\nCalypsos are just shitty to be shitty in a way that's more grating than interesting. \n\nI'm currently more interested in this Nakagawa guy (might be the wrong name, but the head of Maliwan).",
        "&gt; If they could cut the crew back down to a size where we could see the same people in every video even if it meant reducing the number of videos a week from 7 to 3 or 4, it would be a lot better.\n\nI guess it's nice to fantasize about, but it's just never going to happen. Content production is \\#1 priority, and when multiple people have schedules that don't overlap for weeks at a time, it's not viable to keep it down to a \"core\" cast that also happens to be the original five plus Jeremy.\n\nAlso, plenty of us not only like the new guys, but actively enjoy having them in videos. Jeremy's been there since before Ray even left, and he's blended in insanely well; he doesn't even count as a new guy, he's worked there longer than Ray did for Pete's sake. Alfredo and Fiona brought in a much more youthful and timely sense of humor that was never going to be there otherwise.\n\nHonestly, a lot of their content is better than it was in the last few months of Ray's time at RT. Dude was checked the fuck out, they all felt it in the videos, and the vibe was just awkward a lot more than it was hilarious.",
        "The GTA with Kumal has to be the last AH let's play I watched all the way through.\n\nTheir rework of AHWU has worked imo. Ready Set Show I think can get there once the more they do it. Some of them have been pretty stellar. \n\nHell the new people on the channel I don't think are bad fits at all. Fiona is perfect for the Gen Z viewers. Trevor has really come into his own as well.",
        "Other then Fiona they haven't added anyone new into the rotation in awhile. But Ray left so everything must suck as a result don'tchaknow. Can't *possibly* be the changing humor of the poster or just resentment at all.",
        "AH is still pretty damn great once you adapt to the new personalities (yes, Fiona has grown on me too):\n\nJeremy- The Boston one, aggressive, great at deceiving, slight Napoleon complex\n\nMatt- The epitome of gamer stereotype, Mario Maker Mastermind\n\nTrevor- Former engineer with a hint of Midwest. Still has a bit of childlike whimsy.\n\nAlfredo- Former competitive FPS player, will often be the \"goober\" personality in other genres. Most likely to luck his way into winning in those games.\n\nFiona- Everything you'd expect from a hostile gen z New Yorker. Also a cosplayer. Still the rookie. In charge of most of the AH streams.\n\nNone of those were meant to be insults, but they each have found their little niche and their interactions with the main crew (Geoff, Jack, Ryan, Michael, Gavin) are fantastic.",
        "Any news on whether Fiona or Loaderbot is in BL3?",
        "I bet you everything in my pocket that Fiona will be a DLC hunter",
        "Koromaru is my pick, but he's already been mentioned, so special mention to Hewie / \"That dog\" from Haunting Ground / Resident Evil 4, who helps protect Fiona from rape monsters and helps Leon fight El Gigante.",
        "Theres several characters not shown that are \"staples\", fan favorites, or you would expect. Athena, fiona(2nd main char from tales), axton, sal, krieg, gaige, loader bot, we also don't know if jack is still on a thumb drive or completely gone, etc.\n\nI hope they atleast show up as important parts in dlc.",
        "The Tales crew is easily the strongest band of characters in the series, I just dont think they'll have major roles as far as performance goes. Not to say their presence wont be felt. Rhys owns Atlas which will probably be returning as a manufacturer. They're responsible for Helios crashing into pandora which might have been the final nail in Hyperions coffin so they might be in the position Atlas was in. Fiona and Rhys were the first people we got to see enter an actual Vault so will get to see the outcome of that. They were also the last people to hangout with Scooter. A lot of Athena and Springs characterization came from Tales. Gortys is still a thing! Etc etc etc. The game had a huge impact on games universe so we still get to see the effects it had. It just doesn't require the actual voice talent to return to show it.",
        "All characters are usable. Just because lyre and fiona are objectively worse(and in this case with kyza&amp;astrid the worst) than others, they can work absolutely fine without boss abuse.",
        "It's very disheartening as IMO Rhys and Fiona are the best characters in the BL universe. I'm also pretty sure the leak that proved to be pretty accurate claimed that Rhys will have a pretty crucial role to the story, so that's extra disappointing. Now I'm worired that if Fiona is in, she won't be voiced by Laura Bailey.",
        "Only people i can see doing that are fiona and sasha.\n\nI think this is how it will go:\n\nRhys is now looked up to amd respected, so he acts all serious and professional.\n\nFiona and sasha come into play and aren't having none of it and bring out his dorky side. Will probably make fun of his mustache.",
        "Yeah I'm one of them. I just finished Tales of the Borderlands for the first time two days ago. Episode 5 is my favourite finale in story-telling gaming ever. The whole final conversation between Fiona and Rhys felt so bittersweet, and you as the player controlled both of their dialouge yet it feels so natural. I'm also surprised how much it affected the lore and state of Pandora, given that it's a spin-off game. Really interested to visit Pandora again back in BL3 now that they shook things up in the world-building.\n\nI then bought The Handsome Collection because I needed that Borderlands fix for my PS4. It's a 7 year old game yet it still feels so good to control and play. If the game has a slide feature and the jump to feel less floaty, the movement would feel perfect.\n\nThen I got a friend to purchase The Handsome Collection as well because I wouldn't shut up about the game and how it's still fun. It's contagious.",
        "I hope in Tales fashion, Rhys and Fiona tell you wildly conflicting versions of what happened.",
        "\"Not really her thing as a character\" - Are you sure we played the same game? Fiona was all about becoming a Vault Hunter as she saw this as an opportunity to turn her life around. I'm pretty sure that ending if TFTB isn't the last we've seen of her, and given she doesn't appear in trailer while Rhys does kinda makes me wonder why.",
        "Maybe Fiona could be DLC Vault Hunter. Ever since release of TFTB all I ever heard is how much people would love to be able to play as Fiona in future Borderlands. And since BL2 and Pre-Sequel both ended up rocking 2 DLC charcters, one almost immediately after release this seems like a possibility. Hell, I wouldn't mind getting more than 2 DLC characters.",
        "fiona best waifu",
        "They did confirm Fiona iirc. And according to *some sources* there might be more.",
        "There was a leak on ResetEra that was seemingly confirmed by this trailer that confirms Rhys is the CEO of Atlas, Fiona and Vaughan are NPCs, and Gortys will assist in hunting vaults(?). So don’t worry - all of the Tales characters are returning, barring a couple.",
        "Holy shit Rhys! And I think I saw Fiona too!",
        "I hope this means Fiona is in it as well",
        "You can see Fiona walk towards tannis in the trailer, I think",
        "I was hoping we would maybe be able to play as him or Fiona, still incredibly hyped he’s gonna be apart of the game",
        "I believe Fiona was spotted in the teaser",
        "what? both of you are talking out your ass\n\nRhys is standing around with Zero and a bunch of guys in Crimson Raider armor. he even has a new arm that doesn't look like it's made by Hyperion at *all.* also Fiona isn't in there as far as I can tell Marcus is standing next to Tannis, not Fiona",
        "Exactly this! Him with Zer0 is awesome. Just wondering where Fiona is.",
        "Rhys is backas mustachio'd Hyperion CEO I guess, did anyone see Fiona anywhere?",
        "Who saw scooters sister and sir hammerlock \n\nPS scooter died in tails from the borderlands \nPPS who saw ryes and Fiona ",
        "So many comments raving about Tales and how good it was. It was good for a TT game but totally unlike the main games. I won’t have a problem seeing those characters in the story but the idea that Flax is Loaderbot or that Fiona will be a vault hunter seems silly to me.",
        "Well fragtrap is the claptrap from bl2 and in this trailer too. Dopple jack is also in bl2, when you go to opportunity. Aurelia is rumored to be in it, but i haven't heard anything on Athena. I really hope she'll be with fiona",
        "My not-likely dream is that Fiona was turned into a siren after the end of Tales, she would fit right in with Lilith and Maya. Really I just hope they expand on Siren lore in general, it's been 3/4 games and we barely know anything other than they have some connection to Vaults and Eridians/Eridium.",
        "If Tales of the Borderlands is anything to go by, Fiona might become a full fledged vault hunter, seeing as she was developing her own skill.",
        "That’s Rhys on top of the Atlas logo, and I’m 90% sure the camera passes by a shirtless Vaughn after Hammerlock. Can’t find Sasha, Fiona, or Loaderbot though...",
        "Really hoping for Fiona, Loader Bot and Gortys to show up.",
        "Rhys and Fiona are on the right of the mask near the Atlas logo, I think.",
        "Awesome teaser. Love it. Shows a lot of chars, even from Tales, still I missed, so far, some chars like Rhys, Fiona, Maya and Athena. Well, they could also be hidden somewhere at the end in the whole view.\n\nFurther the music is awesome as well.",
        "See, that was one of the things that  consistently pissed me off about Telltale - they never just let a story *end*.  They had to tack on an arbitrary cliffhanger, even if it came totally out of nowhere, just in case they ever made a Season 2.  It was infuriating, especially as it became increasingly clear that they weren't going to follow up on the vast majority of them.\n\nAlthough at least with Tales From The Borderlands, there's always the small chance that Gearbox will bring back the characters or explain what happened to Rhys &amp; Fiona.  (But I wouldn't hold my breath.)",
        "You may wanna look into “Dangerous Driving”, as it’s by the guys that used to head Criterion Games: Alex Ward &amp; Fiona Sperry.",
        "IDK, i remember Rhys having his cool problem-solving thing (which could be a time slow/environmental trick) along with his implants, and Fiona had her cool elemental gun.\n\nWhat I liked about the game is they started out so fumbling and scrambling and both proved themselves as resourceful and able by the end.  \n\nBut for real, I'd really just love Fiona with a really low-cooldown elemental pistol ability that can apply different effects, or different cooldowns for each barrel.",
        "I never understood this. Rhys and Fiona had their game, and they have their style, both admit that they aren’t shooter and bandit like vault hunters their thinkers and problem solvers, the wouldn’t fit in a traditional borderlands game.",
        "I mean, if Tales' critical success (albiet commercial failure) showed anything, it's that the series actually does have room for rich lore and sightly more tame humor.\n\nRhys, Fiona, Sasha, Gortys and LoaderBot also need a fitting conclusion to their story now that Telltale is dead",
        "At the end of episode 2 the group enters the secret Atlas base to get Gortys. They get ambushed by Rhys's boss and Sasha's ex lover with a group of bandits and are forced to activate the project.\n\n&amp;#x200B;\n\nThey create Gortys and accidentally activate the security system of the base which sends out a couple of drones. Everything is extreme tense and you must decide if you trust Fiona or let handsome Jack taker over your system so that you can take over the whole facility.\n\n&amp;#x200B;\n\nEvery sane person would choose Fiona over Jack but I did it for shit and giggles. In episode 3 Handsome Jack + You actually takes over the drones at first and use them against the bandits. Fiona is aware that this is Rhys doing (he even acknowledges that). Than Jack runs Amok and let the drones shoot at everything. They escape and meet Valerie (the old mob boss lady) etc.\n\n&amp;#x200B;\n\nNobody asked how Rhys was able to take over the drones or Atlas facility. Or why the drones started attacking everyone.. Couldn't get over it how nobody cared.",
        "Yeah after that cliff hanger rehys and Fiona gotta be teleported into BL3",
        "Nah, I BETTER get Rhys and Fiona in BL3 OR ELSE",
        "(looks her up)  OOoooooohhhh.  She was Serana in Skyrim and Fiona in TFTB?  OK, yep.  She's good."
    ]
}